tests/load/results/2026-02-26-health-ab-lenient.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3800

Document Path:          /api/health
Document Length:        Variable

Concurrency Level:      50
Time taken for tests:   1.308 seconds
Complete requests:      5000
Failed requests:        0
Non-2xx responses:      5000
Total transferred:      1470600 bytes
HTML transferred:       589800 bytes
Requests per second:    3822.48 [#/sec] (mean)
Time per request:       13.081 [ms] (mean)
Time per request:       0.262 [ms] (mean, across all concurrent requests)
Transfer rate:          1097.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   5.5      3      22
Processing:     1    8   6.5      6      43
Waiting:        1    8   6.5      6      42
Total:          3   13  10.9      7      53

Percentage of the requests served within a certain time (ms)
  50%      7
  66%     12
  75%     17
  80%     21
  90%     31
  95%     35
  98%     46
  99%     50
 100%     53 (longest request)