tests/load/results/2026-02-26-health-ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3800

Document Path:          /api/health
Document Length:        152 bytes

Concurrency Level:      50
Time taken for tests:   1.157 seconds
Complete requests:      5000
Failed requests:        4620
   (Connect: 0, Receive: 0, Length: 4620, Exceptions: 0)
Non-2xx responses:      5000
Total transferred:      1469820 bytes
HTML transferred:       589060 bytes
Requests per second:    4323.25 [#/sec] (mean)
Time per request:       11.565 [ms] (mean)
Time per request:       0.231 [ms] (mean, across all concurrent requests)
Transfer rate:          1241.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   4.8      2      20
Processing:     2    7   5.6      5      40
Waiting:        2    7   5.6      5      40
Total:          4   11   9.3      7      50

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      9
  75%     14
  80%     17
  90%     26
  95%     31
  98%     43
  99%     47
 100%     50 (longest request)